<template>
  <div class="w-100 h-100 fill-height d-flex justify-center align-center">
    <v-card class="w-25">
      <v-card-text>
        1. главная страница:
        • краткая информация о приложении
        • меню навигации для доступа к различным разделам приложения (студенты, преподаватели, курсы, экзамены).
        2. раздел "Студенты":
        • список всех студентов с возможностью поиска и фильтрации (по имени, группе, факультету и т.д.).
        • карточка студента с подробной информацией (ФИО, дата рождения, факультет, группа, успеваемость, стипендия, количество детей).
        • возможность добавления, редактирования и удаления информации о студентах.
        3. раздел "Преподаватели":
        • список всех преподавателей с возможностью поиска и фильтрации (по имени, факультету, курсам и т.д.).
        • карточка преподавателя с подробной информацией (ФИО, факультет, должность, курсы).
        • возможность добавления, редактирования и удаления информации о преподавателях.
        4. раздел "Курсы":
        • список всех курсов с возможностью поиска и фильтрации (по названию, преподавателю и т.д.).
        • карточка курса с подробной информацией (название курса, описание, преподаватель, расписание).
        • возможность добавления, редактирования и удаления курсов.
        5. раздел "Экзамены":
        • список всех экзаменов с возможностью поиска и фильтрации (по курсу, дате, группе и т.д.).
        • карточка экзамена с подробной информацией (курс, дата, группа, тип экзамена, список студентов и их оценки).
        • возможность добавления, редактирования и удаления экзаменов.
      </v-card-text>
    </v-card>
  </div>
</template>

<script lang="ts" setup>
  //
</script>
